       01  W-ASSURE.
           02 A-MAT           PIC 9(6).
           02 A-NOM-PRE       PIC X(20).
           02 A-RUE           PIC X(18).
           02 A-CP            PIC 9(5).
           02 A-VILLE         PIC X(12).
           02 A-CODE          PIC X(1).
           02 A-PRIME         PIC 9(4)V99.
           02 A-BM            PIC X.
           02 A-TAUX          PIC 99.
           02 FILLER          PIC X(9).     
